InformationRegisters/ГлабольныеСостояниеКомплекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ГлабольныеСостояниеКомплекта</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ГлобальныйСтатус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗадач</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗадачаДляБлокировки</Name>
					<Type>
						<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредыдущаяСтадия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтадииКомплекта</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредыдущийСостояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияЗадач</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредыдущийСтатус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗадач</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредыдущийТипЗадачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗадачКонструирования</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтадияПроизводства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтадииКомплекта</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтадияТЗ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтадииКомплекта</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Комплект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Композиции</v8:Type>
						<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИзделиеЗаказчика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИзделияЗаказчика</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ДанныеКомплекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДанныеКомплекта</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаНачалоМонтажа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаНачалоПроектирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаНачалоПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаНачалоРКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаНачалоСогласования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаНачалоТЗ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаОкончаниеМонтажа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаОкончаниеПроектирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаОкончаниеПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаОкончаниеРКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаОкончаниеСогласования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаОкончаниеТЗ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяПродолжительностьПроизводства</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоСогласований</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Конструктор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Приоритеты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекущаяСтадия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтадииКомплекта</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекущаяСтадияПроизводства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтадииКомплекта</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Комплект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Композиции</v8:Type>
						<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
						<v8:Type>cfg:CatalogRef.ГабаритныеЧертежи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтатусыЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыЗадач</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ГлобальнаяПауза</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлобальнаяПриостановкаРаботы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлобальныйПровал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлобальныйУспех</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГЧ_Ожидание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГЧ_Проверка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗавершенаЗадача</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗавершенаЗадачаРКД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Замер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Запрос</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Изменение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеРКД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Корректировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаРКД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МонтажПередача</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеГЧ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отмена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пауза</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрисвоенНомерPDM</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизводствоМалярка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизводствоМалярка2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизводствоОгружено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизводствоОгрузкаЧастичная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизводствоОжидание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизводствоОтгрузка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизводствоПодрядчик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизводствоПодрядчик2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизводствоСтолярка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизводствоСтолярка2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизводствоСтолярка3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизводствоУпаковка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РазработкаРКД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РКД_ожидание_согласования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СозданиеЭлемента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Стоп</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТЗВнешнееОжидание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТЗВнутреннееОжидание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТЗВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТЗОжидание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТЗПодтверждение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТЗРекламация</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СостоянияЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СостоянияЗадач</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БезИзмененияКП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешнееСогласование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешнийЗапрос</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратСВнешнегоДействия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботеКонструктора</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлобальнаяПауза</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлобальныйПровал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлобальныйУспех</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДизайнерскийКонтроль</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗавершенаДизайнером</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗавершенаКонструктором</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗавершениеПроверкиВедущимКонструктором</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеКП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаДизайнер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеВнешнегоСогласования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеКонструктором</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеПодтвержденияВедущимКонструктором</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеФиндиректором</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтложенаКонструктором</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отмена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаИзделия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриостановкаКонструктором</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/омГантПроизводстваНаСервере/Ext/Module.bsl
#Область Диаграмма
	
Функция ОбновитьГантНаСервере(стПараметры) Экспорт
	
	Диаграмма				= стПараметры.Диаграмма;
	СтруктураДанныеГантаВр	= ПолучитьТаблицуДанных();
	Проекты					= стПараметры.Проекты;
	ВыводитьПроект			= стПараметры.ВыводитьПроект;
	
	ПолучитьДанныеДиаграммы(Проекты, СтруктураДанныеГантаВр);
	
	СтруктураДанныеГанта	= ПолучитьТаблицуДанных();
	
	Если ВыводитьПроект Тогда
		
		стОтбор = Новый Структура("Проект", );
		
		Для каждого х Из СтруктураДанныеГантаВр.тзПроекты Цикл
			
			стОтбор.Проект = х.Проект;
			
			Для каждого текСтрока Из СтруктураДанныеГантаВр.тзДанныеГанта.НайтиСтроки(стОтбор) Цикл
				ЗаполнитьЗначенияСвойств(СтруктураДанныеГанта.тзДанныеГанта.Добавить(), текСтрока);
			КонецЦикла;
		
		КонецЦикла;
		
	Иначе 
		Для каждого текСтрока Из СтруктураДанныеГантаВр.тзДанныеГанта Цикл
			ЗаполнитьЗначенияСвойств(СтруктураДанныеГанта.тзДанныеГанта.Добавить(), текСтрока);
		КонецЦикла;
	КонецЕсли;
	
	
	стПромежуточныеДанные = ПолучитьПромежуточныеДанные(СтруктураДанныеГанта.тзДанныеГанта);   
	
	стПараметры.Вставить("тзДанныеГанта", 	СтруктураДанныеГанта.тзДанныеГанта);
	стПараметры.Вставить("тзПроекты", 		СтруктураДанныеГантаВр.тзПроекты);
	
	СтруктураДанныеГантаВр = Неопределено;

	ПостроитьДиаграммуГанта(стПараметры, стПромежуточныеДанные);
	
	
	Возврат Новый Структура("тзДанныеГанта", ОбщегоНазначения.ТаблицаЗначенийВМассив(СтруктураДанныеГанта.тзДанныеГанта));
	
	
КонецФункции 

Функция ВывестиПроект(стПараметры, текПроект, ДанныеТочки = Неопределено, тзЦвета = Неопределено, стОтборПроект = Неопределено) Экспорт
	
	Диаграмма		= стПараметры.Диаграмма;
	ВыводитьПроект	= стПараметры.ВыводитьПроект;
	Обновить		= стПараметры.Обновить;

	Если НЕ ВыводитьПроект Тогда
		Возврат Неопределено;
	КонецЕсли; 
	
	Если стОтборПроект = Неопределено Тогда
		стОтборПроект 	= Новый Структура("Проект",);
		НайденыеСтроки	= стПараметры.тзДанныеГанта;
	Иначе
		НайденыеСтроки = стПараметры.тзДанныеГанта.НайтиСтроки(стОтборПроект);
	КонецЕсли; 
	
	стОтборПроект.Проект = текПроект;
	
	Если НайденыеСтроки.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Обновить Тогда
		ДанныеТочки 				= ПолучитьДанныеТочки(Диаграмма); 
		ДанныеТочки.СсылкаЗначение 	= Строка(текПроект);
		тзЦвета 					= омДиаграммаГанта.ПолучитьТаблицуЦветов();
	КонецЕсли;
	
	ДанныеТочки.Точка 					= Строка(текПроект);
	ДанныеТочки.Редактирование 			= Ложь;
	ДанныеТочки.ЭтоГруппа 				= Ложь;
	ДанныеТочки.ЕстьРасшифровка			= Ложь;
	ДанныеТочки.СократитьНаименование 	= Ложь;
	ДанныеТочки.ЭтоПлан					= Ложь;
	ДанныеТочки.РодительДиаграммы 		= Неопределено;
	ДанныеТочки.Этап 		  			= "Проект";
	
	стДаты = ПолучитьДатаНачалаОкончания(НайденыеСтроки); 	
	
	ДанныеТочки.ДатаНачала 			= стДаты.ДатаНачала;
	ДанныеТочки.ДатаОкончания	 	= стДаты.ДатаОкончания;
	ДанныеТочки.Продолжительность 	= Окр((стДаты.ДатаОкончания - стДаты.ДатаНачала) / (24 * 3600), 1);
	ДанныеТочки.НаименованиеТочки 	= "";
	
	ВывестиТочку(Диаграмма, ДанныеТочки, тзЦвета, , Обновить);
	
	Если Обновить Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ДанныеТочки;

КонецФункции

Функция ПолучитьТаблицуДанных() Экспорт

	ТипСтрока 			= Новый ОписаниеТипов("Строка");
	
	ТипБулево 			= Новый ОписаниеТипов("Булево");
	
	КвалификаторыДаты 	= Новый КвалификаторыДаты(ЧастиДаты.Дата);
	ТипДата				= Новый ОписаниеТипов("Дата", , , , , КвалификаторыДаты);
	
	КвалификаторыЧисло 	= Новый КвалификаторыЧисла(5, 0, ДопустимыйЗнак.Неотрицательный);
	ТипЧисло5_0			= Новый ОписаниеТипов("Число", );
	
	КвалификаторыЧисло 	= Новый КвалификаторыЧисла(5, 1, ДопустимыйЗнак.Неотрицательный);
	ТипЧисло5_1			= Новый ОписаниеТипов("Число", );
	
	тзДанныеГанта = Новый ТаблицаЗначений;
	тзДанныеГанта.Колонки.Добавить("ОбъектТЗ", 				Новый ОписаниеТипов("СправочникСсылка.ИзделияКомплект"));
	тзДанныеГанта.Колонки.Добавить("Комментарий", 			ТипСтрока);
	тзДанныеГанта.Колонки.Добавить("ДатаНачала", 			ТипДата);
	тзДанныеГанта.Колонки.Добавить("Проект", 				Новый ОписаниеТипов("СправочникСсылка.Проекты"));
	тзДанныеГанта.Колонки.Добавить("ОбъектТЗНаименование", 	ТипСтрока);
	тзДанныеГанта.Колонки.Добавить("Продолжительность", 	ТипЧисло5_0);
	тзДанныеГанта.Колонки.Добавить("ДатаОкончания", 		ТипДата);
	тзДанныеГанта.Колонки.Добавить("Край", 					ТипДата);
	тзДанныеГанта.Колонки.Добавить("ПланРазработкиВДнях", 	ТипЧисло5_1);
	тзДанныеГанта.Колонки.Добавить("ЭтоПлан", 				ТипБулево);
	тзДанныеГанта.Колонки.Добавить("Переходы", 				ТипЧисло5_0);
	тзДанныеГанта.Колонки.Добавить("ПродленныйЭтап", 		ТипБулево);
	тзДанныеГанта.Колонки.Добавить("ГлобальныйСтатус", 		Новый ОписаниеТипов("ПеречислениеСсылка.СтатусыЗадач"));
	
	тзПроекты = Новый ТаблицаЗначений;
	тзПроекты.Колонки.Добавить("Проект", 				Новый ОписаниеТипов("СправочникСсылка.Проекты"));
	тзПроекты.Колонки.Добавить("ПроектНаименование",	ТипСтрока);
	тзПроекты.Колонки.Добавить("ПроектНомер",			ТипЧисло5_0);
	тзПроекты.Индексы.Добавить("Проект");

	Возврат Новый Структура("тзДанныеГанта, тзПроекты"
					       , тзДанныеГанта, тзПроекты);

КонецФункции // ПолучитьТаблицуДанных()

Процедура ПостроитьДиаграммуГанта(стПараметры, стПромежуточныеДанные)
	
	Диаграмма		= стПараметры.Диаграмма;
	Проекты			= стПараметры.Проекты;
	ВыводитьПроект	= стПараметры.ВыводитьПроект;
	тзДанныеГанта	= стПараметры.тзДанныеГанта;
	Обновить		= стПараметры.Обновить;

	Диаграмма.Очистить();

	тзЦвета 	= омДиаграммаГанта.ПолучитьТаблицуЦветов();
	
	ПустаяДата 	= Дата(1, 1, 1);
	
	ДанныеТочки = ПолучитьДанныеТочки(Диаграмма);
	
	стОтборПроект 	= Новый Структура("Проект", );
	
	Если ВыводитьПроект Тогда        
		
		стОтборОбъектТЗ 	= Новый Структура("ОбъектТЗ, Проект", );
	
		Для каждого СтрокаПроекты Из стПараметры.тзПроекты Цикл
			
			текПроект = СтрокаПроекты.Проект;
			
			ДанныеТочки.РодительДиаграммы 	= Неопределено;
			ДанныеТочки.СсылкаЗначение		= СтрокаПроекты.ПроектНаименование;
			стОтборПроект.Проект 			= текПроект;
			
			Если ВывестиПроект(стПараметры, текПроект, ДанныеТочки, тзЦвета, стОтборПроект) = Неопределено Тогда 
				Продолжить;
			КонецЕсли;
			
			стОтборОбъектТЗ.Проект 			= текПроект;
			Для каждого текОбъектТЗ Из стПромежуточныеДанные.мОбъектТЗ Цикл
				ВывестиОбъектТЗ(Диаграмма, тзДанныеГанта, текОбъектТЗ, стОтборОбъектТЗ, тзЦвета, ДанныеТочки, СтрокаПроекты.ПроектНаименование);
			КонецЦикла;
		
			
		КонецЦикла;     
		
	Иначе
		
		стОтборОбъектТЗ 	= Новый Структура("ОбъектТЗ");

		Для каждого текОбъектТЗ Из стПромежуточныеДанные.мОбъектТЗ Цикл
			ВывестиОбъектТЗ(Диаграмма, тзДанныеГанта, текОбъектТЗ, стОтборОбъектТЗ, тзЦвета, ДанныеТочки, Неопределено);
		КонецЦикла;
		
	КонецЕсли; 
	
КонецПроцедуры 

Процедура ВывестиОбъектТЗ(Диаграмма, тзДанныеГанта, текОбъектТЗ, стОтборОбъектТЗ, тзЦвета, ДанныеТочки, Родитель)

	стОтборОбъектТЗ.ОбъектТЗ = текОбъектТЗ;
	НайденыеСтроки = тзДанныеГанта.НайтиСтроки(стОтборОбъектТЗ);
	
	Если НайденыеСтроки.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;
	
	ДанныеТочки.Точка 					= текОбъектТЗ;
	ДанныеТочки.СсылкаЗначение 			= текОбъектТЗ;
	ДанныеТочки.РодительДиаграммы		= Родитель;
	ДанныеТочки.Редактирование 			= Истина;
	ДанныеТочки.ЭтоГруппа 				= Ложь;
	ДанныеТочки.ЕстьРасшифровка			= Истина;
	ДанныеТочки.СократитьНаименование 	= Истина;
	
	ПустаяДата = Дата(1, 1, 1);
	
	Для каждого НайденаяСтрока Из НайденыеСтроки Цикл
		
		Если НайденаяСтрока.ДатаНачала = ПустаяДата Тогда
		
			Продолжить;	
		
		КонецЕсли; 
		
		ЗаполнитьЗначенияСвойств(ДанныеТочки, НайденаяСтрока); 
		ДанныеТочки.ДатаОкончания	  = НайденаяСтрока.ДатаОкончания;
		ДанныеТочки.Продолжительность = НайденаяСтрока.Продолжительность;
		ДанныеТочки.НаименованиеТочки = НайденаяСтрока.ОбъектТЗНаименование;// + "." + НайденаяСтрока.Состояние;
		ДанныеТочки.Этап 		  	  = ?(НайденаяСтрока.ГлобальныйСтатус = Перечисления.СтатусыЗадач.ГлобальнаяПриостановкаРаботы,  "ГлобальнаяПриостановкаРаботы", "Производство");
		
		ВывестиТочку(Диаграмма, ДанныеТочки, тзЦвета);
		
	КонецЦикла;   
	
КонецПроцедуры

Функция ПолучитьДанныеТочки(Диаграмма)
	
	ПустаяДата 		= Дата(1, 1, 1);
	Серия = Диаграмма.УстановитьСерию("Комплект");
	
	ДанныеТочки = Новый Структура();
	
	ДанныеТочки.Вставить("Точка", 															);
	ДанныеТочки.Вставить("Серия", 					Серия									);
	ДанныеТочки.Вставить("ДатаНачала", 				ПустаяДата								);
	ДанныеТочки.Вставить("ДатаОкончания", 			ПустаяДата								);
	ДанныеТочки.Вставить("НаименованиеТочки",		""										);
	ДанныеТочки.Вставить("Этап",					""										);
	ДанныеТочки.Вставить("Проект", 															);
	ДанныеТочки.Вставить("Продолжительность", 		0										);
	ДанныеТочки.Вставить("СсылкаЗначение", 													); 
	ДанныеТочки.Вставить("РодительДиаграммы", 												); 
	ДанныеТочки.Вставить("Редактирование", 			Ложь									); 
	ДанныеТочки.Вставить("ЭтоГруппа", 				Ложь									); 
	ДанныеТочки.Вставить("СократитьНаименование",	Ложь									); 
	ДанныеТочки.Вставить("ЕстьРасшифровка", 		Ложь									); 
	ДанныеТочки.Вставить("Приоритет", 														); 
	ДанныеТочки.Вставить("Переходы",				0										); 
	ДанныеТочки.Вставить("ЭтоПлан", 				Ложь									); 
	ДанныеТочки.Вставить("Состояние", 				Перечисления.СостоянияЗадач.ПустаяСсылка()); 
	
	Возврат ДанныеТочки;	
	
КонецФункции // ПолучитьДанныеТочки() 

Функция ПолучитьДатаНачалаОкончания(НайденыеСтроки)
	
	ПустаяДата 		= Дата(1, 1, 1);
	
	стДаты = Новый Структура("ДатаНачала, ДатаОкончания", ПустаяДата, ПустаяДата);
	
	Для каждого НайденаяСтрока Из НайденыеСтроки Цикл
		
		Если НайденаяСтрока.ДатаНачала = ПустаяДата И НайденаяСтрока.ДатаНачала = ПустаяДата Тогда
			Продолжить;	
		КонецЕсли;
		
		Если стДаты.ДатаНачала = ПустаяДата Тогда
			стДаты.ДатаНачала = НайденаяСтрока.ДатаНачала;
		Иначе
			Если стДаты.ДатаНачала > НайденаяСтрока.ДатаНачала И НайденаяСтрока.ДатаНачала > ПустаяДата Тогда
				стДаты.ДатаНачала = НайденаяСтрока.ДатаНачала;
			КонецЕсли;
		КонецЕсли;
		
		Если НайденаяСтрока.ДатаОкончания > стДаты.ДатаОкончания Тогда
			
			стДаты.ДатаОкончания = НайденаяСтрока.ДатаОкончания;	
		
		КонецЕсли;		
		
	КонецЦикла; 
	
	Возврат стДаты;

КонецФункции // ПолучитьДатаНачалаОкончания()

Функция ВывестиТочку(Диаграмма, ДанныеТочки, тзЦвета, ТекущийЦвет = Неопределено, Обновить = Ложь)

	СекундВСутках 	= 24 * 3600;
	ПустаяДата 		= Дата(1, 1, 1);
	
	Если ДанныеТочки.ДатаНачала = ПустаяДата Тогда
	
		Возврат Неопределено;	
	
	КонецЕсли;
	
	Если Обновить Тогда

		КомплектТочка 			= Диаграмма.УстановитьТочку(ДанныеТочки.СсылкаЗначение, ДанныеТочки.РодительДиаграммы);
		КомплектТочка.Текст 	= ДанныеТочки.НаименованиеТочки;
		Значение = Диаграмма.ПолучитьЗначение(КомплектТочка, ДанныеТочки.Серия);
		Если Значение.Количество() = 0 Тогда
			Возврат Неопределено;	
		КонецЕсли;
		
		Значение.Очистить();	
		
		Интервал 				= Значение.Добавить();
	Иначе
		
		КомплектТочка 			= Диаграмма.УстановитьТочку(ДанныеТочки.СсылкаЗначение, ДанныеТочки.РодительДиаграммы);
		КомплектТочка.Текст 	= ДанныеТочки.НаименованиеТочки;
		Значение 				= Диаграмма.ПолучитьЗначение(КомплектТочка, ДанныеТочки.Серия);
		Значение.Редактирование = ДанныеТочки.Редактирование;
		
		Интервал 				= Значение.Добавить();

	КонецЕсли; 
	
	Диаграмма.РазвернутьТочку(КомплектТочка, Истина);
	
	Интервал.Начало = ДанныеТочки.ДатаНачала;
	Интервал.Конец 	= КонецДня(?(ДанныеТочки.ДатаОкончания - ДанныеТочки.ДатаНачала < СекундВСутках, ДанныеТочки.ДатаНачала + СекундВСутках, ДанныеТочки.ДатаОкончания));
	
	Если НЕ ТекущийЦвет = Неопределено Тогда
		Интервал.Цвет			= ТекущийЦвет;
	ИначеЕсли НЕ тзЦвета = Неопределено Тогда 
		Интервал.Цвет	= омДиаграммаГанта.ПолучитьЦвет(ДанныеТочки.Этап, тзЦвета, ДанныеТочки.ЭтоГруппа, ДанныеТочки.СократитьНаименование);
	КонецЕсли;
	
	Если ДанныеТочки.ЕстьРасшифровка Тогда
		Интервал.Расшифровка 	= Новый Структура("Проект, СсылкаКомплект, Продолжительность"
		, ДанныеТочки.Проект, ДанныеТочки.СсылкаЗначение, ДанныеТочки.Продолжительность);
	Иначе
		Интервал.Расшифровка 	= Неопределено;
	КонецЕсли;
	
	Если ДанныеТочки.СократитьНаименование Тогда
		Интервал.Текст = Лев(Интервал.Текст, 1);
	КонецЕсли;
	
	Возврат Интервал;
	
КонецФункции // ВывестиТочку()

Функция ПолучитьПромежуточныеДанные(тзДанныеГанта)
	
	ОписаниеЧисло = Новый ОписаниеТипов("Число");
	
	мОбъектТЗ 		= Новый Массив;

	ПустаяДата = Дата(1, 1, 1); 
	
    стПромежуточныеДанные 	= Новый Структура("ДатаНачала, 	ДатаОкончания, КрайПКД, 	КрайРКД",
											   ПустаяДата,  ПустаяДата,    ПустаяДата, 	ПустаяДата);
											   
	ПриостановкаКонструктором 	= Перечисления.СостоянияЗадач.ПриостановкаКонструктором;										   
	СостояниеОжидания 			= Перечисления.СостоянияЗадач.ОжиданиеКонструктором;
	
	мДобавитьСтроки = Новый Массив;
	НаименованиеКолонокТаблицы = омОбщиеФункции.КолонкиТаблицыЗначений(тзДанныеГанта);
	ТД = НачалоДня(ТекущаяДата());
	
	Для каждого х Из тзДанныеГанта Цикл 
		
		
		Если х.ЭтоПлан Тогда
			
			х.ДатаНачала 	= х.ДатаНачалаПлан;	
			
		КонецЕсли;

		Если х.ДатаНачала > ПустаяДата И НЕ х.ПродленныйЭтап И х.ДатаОкончания = ПустаяДата Тогда
			х.ДатаОкончания = омДаты.ДобавитьДниСУчетомВыходных(х.ДатаНачала, х.Продолжительность); 			
		КонецЕсли;
		
		Если х.ДатаНачала > ПустаяДата Тогда
		
			Если стПромежуточныеДанные.ДатаНачала = ПустаяДата Тогда
			
				стПромежуточныеДанные.ДатаНачала = х.ДатаНачала;
				
			ИначеЕсли стПромежуточныеДанные.ДатаНачала > х.ДатаНачала Тогда 
				
				стПромежуточныеДанные.ДатаНачала = х.ДатаНачала;
			
			КонецЕсли;
			
			Если стПромежуточныеДанные.ДатаОкончания < х.ДатаОкончания Тогда
			
				стПромежуточныеДанные.ДатаОкончания = х.ДатаОкончания;	
			
			КонецЕсли;
		
		КонецЕсли; 
		
		ДобавитьВМассив(х.ОбъектТЗ, 	мОбъектТЗ);
		
	КонецЦикла;
	
	Для каждого ЭлементМассиваДанных Из мДобавитьСтроки Цикл
	
		ЗаполнитьЗначенияСвойств(тзДанныеГанта.Добавить(), ЭлементМассиваДанных);
	
	КонецЦикла;
	
	стПромежуточныеДанные.Вставить("мОбъектТЗ", 	мОбъектТЗ);

	Возврат стПромежуточныеДанные; 

КонецФункции // ПолучитьпромежуточныеДанные()

Процедура ДобавитьВМассив(Элемент, МассивДляДобавления)

	Если МассивДляДобавления.Найти(Элемент) = Неопределено Тогда
	
		МассивДляДобавления.Добавить(Элемент);	
	
	КонецЕсли;	

КонецПроцедуры

Процедура ПолучитьДанныеДиаграммы(Проекты, СтруктураДанныеГанта)

	Запрос = Новый Запрос;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ГлабольныеСостояниеКомплектаСрезПоследних.Комплект КАК Справочник.ИзделияКомплект) КАК Комплект,
		|	ГлабольныеСостояниеКомплектаСрезПоследних.ГлобальныйСтатус КАК ГлобальныйСтатус
		|ПОМЕСТИТЬ втПауза
		|ИЗ
		|	РегистрСведений.ГлабольныеСостояниеКомплекта.СрезПоследних КАК ГлабольныеСостояниеКомплектаСрезПоследних
		|ГДЕ
		|	ГлабольныеСостояниеКомплектаСрезПоследних.Комплект.Проект В(&Проекты)
		|	И ГлабольныеСостояниеКомплектаСрезПоследних.Комплект ССЫЛКА Справочник.ИзделияКомплект
		|	И ГлабольныеСостояниеКомплектаСрезПоследних.ГлобальныйСтатус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗадач.ГлобальнаяПриостановкаРаботы)
		|
		|СГРУППИРОВАТЬ ПО
		|	ГлабольныеСостояниеКомплектаСрезПоследних.Комплект,
		|	ГлабольныеСостояниеКомплектаСрезПоследних.ГлобальныйСтатус
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеКомплектаСрезПоследних.Комплект КАК ОбъектТЗ,
		|	ДанныеКомплектаСрезПоследних.ВнешняяПродолжительностьПроизводства КАК Продолжительность,
		|	ДанныеКомплектаСрезПоследних.ВнешняяДатаНачалоПроизводства КАК ДатаНачала,
		|	ДанныеКомплектаСрезПоследних.ВнешняяДатаОкончаниеПроизводства КАК ДатаОкончания,
		|	ДанныеКомплектаСрезПоследних.Комплект.Проект.Ссылка КАК Проект,
		|	ДанныеКомплектаСрезПоследних.Комплект.Проект.Номер КАК ПроектНомер,
		|	ДанныеКомплектаСрезПоследних.Комплект.Проект.Наименование КАК ПроектНаименование,
		|	ДанныеКомплектаСрезПоследних.Комплект.Наименование КАК ОбъектТЗНаименование,
		|	НазначениеПодрядчикаКомплекты.Комплект КАК Комплект,
		|	ЕСТЬNULL(втПауза.ГлобальныйСтатус, ЗНАЧЕНИЕ(Перечисление.СтатусыЗадач.ПустаяСсылка)) КАК ГлобальныйСтатус
		|ИЗ
		|	РегистрСведений.ДанныеКомплекта.СрезПоследних КАК ДанныеКомплектаСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.НазначениеПодрядчика.Комплекты КАК НазначениеПодрядчикаКомплекты
		|		ПО ДанныеКомплектаСрезПоследних.Комплект = НазначениеПодрядчикаКомплекты.Комплект
		|		ЛЕВОЕ СОЕДИНЕНИЕ втПауза КАК втПауза
		|		ПО ДанныеКомплектаСрезПоследних.Комплект = втПауза.Комплект
		|ГДЕ
		|	ДанныеКомплектаСрезПоследних.Комплект.Проект В(&Проекты)
		|	И НЕ ДанныеКомплектаСрезПоследних.Комплект.ЭтоГруппа
		|	И ДанныеКомплектаСрезПоследних.Комплект ССЫЛКА Справочник.ИзделияКомплект
		|	И (НЕ НазначениеПодрядчикаКомплекты.Производство
		|			ИЛИ НазначениеПодрядчикаКомплекты.Производство ЕСТЬ NULL)";
	
	Запрос.УстановитьПараметр("Проекты", Проекты);
	
	Выборка =  Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		//тзДанныеГанта, тзПроекты
		ЗаполнитьЗначенияСвойств(СтруктураДанныеГанта.тзДанныеГанта.Добавить(), Выборка);
		
		Если СтруктураДанныеГанта.тзПроекты.Найти(Выборка.Проект) = Неопределено Тогда
			ЗаполнитьЗначенияСвойств(СтруктураДанныеГанта.тзПроекты.Добавить(), Выборка);
		КонецЕсли;
		
	КонецЦикла;
	
	СтруктураДанныеГанта.тзПроекты.Сортировать("ПроектНомер");
	СтруктураДанныеГанта.тзДанныеГанта.Сортировать("ОбъектТЗНаименование");

КонецПроцедуры // ПолучитьДанныеДиаграммы()      

#КонецОбласти
